; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_12)

	(:domain sailing)

	(:objects
		b1 - boat
		p0 p1 - person
	)

	(:init
		(= (x b1) 3)
		(= (y b1) 0)

		(= (d p0) 120)
		(= (d p1) 59)

	)

	(:goal
		(and
			(saved p0)
			(saved p1)

		)
	)
)

; plan
1. (go_north_east b1)
   changed: (x b1) from 3 to 4.5, (y b1) from 0 to 1.5
   goals met: 0 of 2
2. (go_north_west b1)
   changed: (x b1) from 4.5 to 3, (y b1) from 1.5 to 3
   goals met: 0 of 2
3. (go_north_west b1)
   changed: (x b1) from 3 to 1.5, (y b1) from 3 to 4.5
   goals met: 0 of 2
4. (go_north_west b1)
   changed: (x b1) from 1.5 to 0, (y b1) from 4.5 to 6
   goals met: 0 of 2
5. (go_north_west b1)
   changed: (x b1) from 0 to -1.5, (y b1) from 6 to 7.5
   goals met: 0 of 2
6. (go_north_west b1)
   changed: (x b1) from -1.5 to -3, (y b1) from 7.5 to 9
   goals met: 0 of 2
7. (go_north_west b1)
   changed: (x b1) from -3 to -4.5, (y b1) from 9 to 10.5
   goals met: 0 of 2
8. (go_north_west b1)
   changed: (x b1) from -4.5 to -6, (y b1) from 10.5 to 12
   goals met: 0 of 2
9. (go_north_west b1)
   changed: (x b1) from -6 to -7.5, (y b1) from 12 to 13.5
   goals met: 0 of 2
10. (go_north_west b1)
   changed: (x b1) from -7.5 to -9, (y b1) from 13.5 to 15
   goals met: 0 of 2
11. (go_north_west b1)
   changed: (x b1) from -9 to -10.5, (y b1) from 15 to 16.5
   goals met: 0 of 2
12. (go_north_west b1)
   changed: (x b1) from -10.5 to -12, (y b1) from 16.5 to 18
   goals met: 0 of 2
13. (go_north_west b1)
   changed: (x b1) from -12 to -13.5, (y b1) from 18 to 19.5
   goals met: 0 of 2
14. (go_north_west b1)
   changed: (x b1) from -13.5 to -15, (y b1) from 19.5 to 21
   goals met: 0 of 2
15. (go_north_west b1)
   changed: (x b1) from -15 to -16.5, (y b1) from 21 to 22.5
   goals met: 0 of 2
16. (go_north_west b1)
   changed: (x b1) from -16.5 to -18, (y b1) from 22.5 to 24
   goals met: 0 of 2
17. (go_north_west b1)
   changed: (x b1) from -18 to -19.5, (y b1) from 24 to 25.5
   goals met: 0 of 2
18. (go_north_west b1)
   changed: (x b1) from -19.5 to -21, (y b1) from 25.5 to 27
   goals met: 0 of 2
19. (go_north_west b1)
   changed: (x b1) from -21 to -22.5, (y b1) from 27 to 28.5
   goals met: 0 of 2
20. (go_north_west b1)
   changed: (x b1) from -22.5 to -24, (y b1) from 28.5 to 30
   goals met: 0 of 2
21. (go_north_west b1)
   changed: (x b1) from -24 to -25.5, (y b1) from 30 to 31.5
   goals met: 0 of 2
22. (go_north_west b1)
   changed: (x b1) from -25.5 to -27, (y b1) from 31.5 to 33
   goals met: 0 of 2
23. (go_north_west b1)
   changed: (x b1) from -27 to -28.5, (y b1) from 33 to 34.5
   goals met: 0 of 2
24. (go_north_west b1)
   changed: (x b1) from -28.5 to -30, (y b1) from 34.5 to 36
   goals met: 0 of 2
25. (go_north_west b1)
   changed: (x b1) from -30 to -31.5, (y b1) from 36 to 37.5
   goals met: 0 of 2
26. (go_north_west b1)
   changed: (x b1) from -31.5 to -33, (y b1) from 37.5 to 39
   goals met: 0 of 2
27. (go_north_west b1)
   changed: (x b1) from -33 to -34.5, (y b1) from 39 to 40.5
   goals met: 0 of 2
28. (go_north_west b1)
   changed: (x b1) from -34.5 to -36, (y b1) from 40.5 to 42
   goals met: 0 of 2
29. (go_north_west b1)
   changed: (x b1) from -36 to -37.5, (y b1) from 42 to 43.5
   goals met: 0 of 2
30. (go_north_west b1)
   changed: (x b1) from -37.5 to -39, (y b1) from 43.5 to 45
   goals met: 0 of 2
31. (go_north_west b1)
   changed: (x b1) from -39 to -40.5, (y b1) from 45 to 46.5
   goals met: 0 of 2
32. (go_north_west b1)
   changed: (x b1) from -40.5 to -42, (y b1) from 46.5 to 48
   goals met: 0 of 2
33. (go_north_west b1)
   changed: (x b1) from -42 to -43.5, (y b1) from 48 to 49.5
   goals met: 0 of 2
34. (go_north_west b1)
   changed: (x b1) from -43.5 to -45, (y b1) from 49.5 to 51
   goals met: 0 of 2
35. (go_north_west b1)
   changed: (x b1) from -45 to -46.5, (y b1) from 51 to 52.5
   goals met: 0 of 2
36. (go_north_west b1)
   changed: (x b1) from -46.5 to -48, (y b1) from 52.5 to 54
   goals met: 0 of 2
37. (go_north_east b1)
   changed: (x b1) from -48 to -46.5, (y b1) from 54 to 55.5
   goals met: 0 of 2
38. (go_north_east b1)
   changed: (x b1) from -46.5 to -45, (y b1) from 55.5 to 57
   goals met: 0 of 2
39. (go_north_east b1)
   changed: (x b1) from -45 to -43.5, (y b1) from 57 to 58.5
   goals met: 0 of 2
40. (go_north_east b1)
   changed: (x b1) from -43.5 to -42, (y b1) from 58.5 to 60
   goals met: 0 of 2
41. (go_north_east b1)
   changed: (x b1) from -42 to -40.5, (y b1) from 60 to 61.5
   goals met: 0 of 2
42. (go_north_east b1)
   changed: (x b1) from -40.5 to -39, (y b1) from 61.5 to 63
   goals met: 0 of 2
43. (go_north_east b1)
   changed: (x b1) from -39 to -37.5, (y b1) from 63 to 64.5
   goals met: 0 of 2
44. (go_north_east b1)
   changed: (x b1) from -37.5 to -36, (y b1) from 64.5 to 66
   goals met: 0 of 2
45. (go_north_east b1)
   changed: (x b1) from -36 to -34.5, (y b1) from 66 to 67.5
   goals met: 0 of 2
46. (go_north_east b1)
   changed: (x b1) from -34.5 to -33, (y b1) from 67.5 to 69
   goals met: 0 of 2
47. (go_north_east b1)
   changed: (x b1) from -33 to -31.5, (y b1) from 69 to 70.5
   goals met: 0 of 2
48. (go_north_east b1)
   changed: (x b1) from -31.5 to -30, (y b1) from 70.5 to 72
   goals met: 0 of 2
49. (go_north_east b1)
   changed: (x b1) from -30 to -28.5, (y b1) from 72 to 73.5
   goals met: 0 of 2
50. (go_north_east b1)
   changed: (x b1) from -28.5 to -27, (y b1) from 73.5 to 75
   goals met: 0 of 2
51. (go_north_east b1)
   changed: (x b1) from -27 to -25.5, (y b1) from 75 to 76.5
   goals met: 0 of 2
52. (go_north_east b1)
   changed: (x b1) from -25.5 to -24, (y b1) from 76.5 to 78
   goals met: 0 of 2
53. (go_north_east b1)
   changed: (x b1) from -24 to -22.5, (y b1) from 78 to 79.5
   goals met: 0 of 2
54. (go_north_east b1)
   changed: (x b1) from -22.5 to -21, (y b1) from 79.5 to 81
   goals met: 0 of 2
55. (go_north_east b1)
   changed: (x b1) from -21 to -19.5, (y b1) from 81 to 82.5
   goals met: 0 of 2
56. (go_north_east b1)
   changed: (x b1) from -19.5 to -18, (y b1) from 82.5 to 84
   goals met: 0 of 2
57. (go_north_east b1)
   changed: (x b1) from -18 to -16.5, (y b1) from 84 to 85.5
   goals met: 0 of 2
58. (go_north_east b1)
   changed: (x b1) from -16.5 to -15, (y b1) from 85.5 to 87
   goals met: 0 of 2
59. (go_north_east b1)
   changed: (x b1) from -15 to -13.5, (y b1) from 87 to 88.5
   goals met: 0 of 2
60. (go_north_east b1)
   changed: (x b1) from -13.5 to -12, (y b1) from 88.5 to 90
   goals met: 0 of 2
61. (go_north_east b1)
   changed: (x b1) from -12 to -10.5, (y b1) from 90 to 91.5
   goals met: 0 of 2
62. (go_north_east b1)
   changed: (x b1) from -10.5 to -9, (y b1) from 91.5 to 93
   goals met: 0 of 2
63. (go_north_east b1)
   changed: (x b1) from -9 to -7.5, (y b1) from 93 to 94.5
   goals met: 0 of 2
64. (go_north_east b1)
   changed: (x b1) from -7.5 to -6, (y b1) from 94.5 to 96
   goals met: 0 of 2
65. (go_north_east b1)
   changed: (x b1) from -6 to -4.5, (y b1) from 96 to 97.5
   goals met: 0 of 2
66. (go_north_east b1)
   changed: (x b1) from -4.5 to -3, (y b1) from 97.5 to 99
   goals met: 0 of 2
67. (go_north_east b1)
   changed: (x b1) from -3 to -1.5, (y b1) from 99 to 100.5
   goals met: 0 of 2
68. (go_north_east b1)
   changed: (x b1) from -1.5 to 0, (y b1) from 100.5 to 102
   goals met: 0 of 2
69. (go_north_west b1)
   changed: (x b1) from 0 to -1.5, (y b1) from 102 to 103.5
   goals met: 0 of 2
70. (go_north_west b1)
   changed: (x b1) from -1.5 to -3, (y b1) from 103.5 to 105
   goals met: 0 of 2
71. (go_north_west b1)
   changed: (x b1) from -3 to -4.5, (y b1) from 105 to 106.5
   goals met: 0 of 2
72. (go_north_west b1)
   changed: (x b1) from -4.5 to -6, (y b1) from 106.5 to 108
   goals met: 0 of 2
73. (go_north_west b1)
   changed: (x b1) from -6 to -7.5, (y b1) from 108 to 109.5
   goals met: 0 of 2
74. (go_north_west b1)
   changed: (x b1) from -7.5 to -9, (y b1) from 109.5 to 111
   goals met: 0 of 2
75. (go_north_east b1)
   changed: (x b1) from -9 to -7.5, (y b1) from 111 to 112.5
   goals met: 0 of 2
76. (go_north_east b1)
   changed: (x b1) from -7.5 to -6, (y b1) from 112.5 to 114
   goals met: 0 of 2
77. (go_north_east b1)
   changed: (x b1) from -6 to -4.5, (y b1) from 114 to 115.5
   goals met: 0 of 2
78. (go_north_east b1)
   changed: (x b1) from -4.5 to -3, (y b1) from 115.5 to 117
   goals met: 0 of 2
79. (go_north_east b1)
   changed: (x b1) from -3 to -1.5, (y b1) from 117 to 118.5
   goals met: 0 of 2
80. (go_north_east b1)
   changed: (x b1) from -1.5 to 0, (y b1) from 118.5 to 120
   goals met: 0 of 2
81. (save_person b1 p0)
   added: (saved p0)
   goals met: 1 of 2
82. (go_south_west b1)
   changed: (x b1) from 0 to 2, (y b1) from 120 to 118
   goals met: 1 of 2
83. (go_south_west b1)
   changed: (x b1) from 2 to 4, (y b1) from 118 to 116
   goals met: 1 of 2
84. (go_south_west b1)
   changed: (x b1) from 4 to 6, (y b1) from 116 to 114
   goals met: 1 of 2
85. (go_south_east b1)
   changed: (x b1) from 6 to 4, (y b1) from 114 to 112
   goals met: 1 of 2
86. (go_south_east b1)
   changed: (x b1) from 4 to 2, (y b1) from 112 to 110
   goals met: 1 of 2
87. (go_south_east b1)
   changed: (x b1) from 2 to 0, (y b1) from 110 to 108
   goals met: 1 of 2
88. (go_south_west b1)
   changed: (x b1) from 0 to 2, (y b1) from 108 to 106
   goals met: 1 of 2
89. (go_south_west b1)
   changed: (x b1) from 2 to 4, (y b1) from 106 to 104
   goals met: 1 of 2
90. (go_south_west b1)
   changed: (x b1) from 4 to 6, (y b1) from 104 to 102
   goals met: 1 of 2
91. (go_south_west b1)
   changed: (x b1) from 6 to 8, (y b1) from 102 to 100
   goals met: 1 of 2
92. (go_south_west b1)
   changed: (x b1) from 8 to 10, (y b1) from 100 to 98
   goals met: 1 of 2
93. (go_south_west b1)
   changed: (x b1) from 10 to 12, (y b1) from 98 to 96
   goals met: 1 of 2
94. (go_south_east b1)
   changed: (x b1) from 12 to 10, (y b1) from 96 to 94
   goals met: 1 of 2
95. (go_south_east b1)
   changed: (x b1) from 10 to 8, (y b1) from 94 to 92
   goals met: 1 of 2
96. (go_south_east b1)
   changed: (x b1) from 8 to 6, (y b1) from 92 to 90
   goals met: 1 of 2
97. (go_south_east b1)
   changed: (x b1) from 6 to 4, (y b1) from 90 to 88
   goals met: 1 of 2
98. (go_south_east b1)
   changed: (x b1) from 4 to 2, (y b1) from 88 to 86
   goals met: 1 of 2
99. (go_south_east b1)
   changed: (x b1) from 2 to 0, (y b1) from 86 to 84
   goals met: 1 of 2
100. (save_person b1 p1)
   added: (saved p1)
   goals met: 2 of 2
